"use strict";

document.getElementById('descript').innerHTML = `<p> Задача: 
3. Вывести в консоль значения выражений и объяснить почему получились такие значения используя комментарии
 к каждому выражению:
 </p><p>
\`\`\`</p><p>
10 + 10 + "10"</p><p>
10 + "10" + 10</p><p>
10 + 10 + +"10"</p><p>
10 / -""</p><p>
10 / +"2,5"</p><p>
\`\`\`
</p>`;
console.clear();
f();

function f() {
    console.log('10 + 10 + "10" = ' + 10 + 10 + "10" + ' по порядку складываются сначала цифры 10 и 10, потом конкатенация со строкой "10"');
    console.log('10 + "10" + 10 = ' + 10 + "10" + 10 + ' конкатенация цифра 10 и строка "10", и снова конкатенация строка "1010" с цифрой 10');
    console.log('10 + 10 + +"10" = ' + 10 + 10 + +"10" + ' тут строка +"10" переводится в число, потом все операнды складываются ');
    console.log('10 / -"" = ' + 10 / -"" + ' цифру 10 делим на -0 (пустую строку, которую перевели в цифру добавив минус будет -0 ), получаем минус бесконечность.');
    console.log('10 / +"2,5" = ' + 10 / +"2,5" + ' разделителем дробной части является . поэтому переводя в число "2,5" получим NaN. 10 / на NaN получим NaN.');
    document.getElementById('decision').innerHTML = `По условию задачи, ответ выведен в консоль`;

}
