"use strict";


document.getElementById('descript').innerHTML = `<p> Задача: 
1. Программа спрашивает у пользователя температуру в 
градусах по Цельсию (используем prompt чтобы ее получить).
 Используя alert программа выводит данную температуру в градусах по Фаренгейту.
Подсказка, расчёт идёт по формуле:
Tf = (9 / 5) * Tc + 32, где Tf – температура по Фаренгейту, Tc – температура по Цельсию.
</p>`;

f();

function f() {

    const tCels = +prompt('введите температуру в градусах цельсия');
    let tFar = (9 / 5) * tCels + 32;
    alert(`Введенная температура ${tCels} по фаренгейту  равна ${tFar} градусов`);
    document.getElementById('decision').innerHTML = `Введенная температура ${tCels} по фаренгейту  равна ${tFar} градусов`;

}

