"use strict";


document.getElementById('descript').innerHTML = `<p> Задача: 
6. Реализовать функцию с тремя параметрами: function mathOperation(arg1, arg2, operation),
где arg1, arg2 – значения аргументов, operation – строка с названием операции. В зависимости от
переданного значения операции (использовать switch) выполнить одну из арифметических операций
(использовать функции из задания 5) и вернуть полученное значение.
</p>`;
console.clear();
f();

function f() {

    const arg1 = +prompt("введите цифру arg1");
    const arg2 = +prompt("введите цифру arg2");
    const operation = prompt("введите знак действия + - * / ");
    //mathOperation(arg1, arg2, operation);

    function mathOperation(arg1, arg2, operation) {
        let a;
        switch (operation) {
            case "+":
                console.log(a = arg1 + arg2);
                return (a);
            case "-":
                console.log(a = arg1 - arg2);
                return (a);
            case "/":
                console.log(a = arg1 / arg2);
                return (a);
            case "*":
                console.log(a = arg1 * arg2);
                return (a);
            default:
                console.log(`Что то пошло не так. Попробуйте еще раз.`);
                break;
        }

    }

    document.getElementById('decision').innerHTML = ` 
   ${arg1}  ${operation} ${arg2} = ${mathOperation(arg1, arg2, operation)}
   `;

}

/*

Материалы обязательные к изучению:
Видео про стрелочные функции стандарта ES6 - https://youtu.be/TjeY_VjzSt0
Видео про JSDoc - https://youtu.be/pM9YHZ5Og5E
Видео про области видимости - https://youtu.be/lP0nrofUIRU


6. Реализовать функцию с тремя параметрами: function mathOperation(arg1, arg2, operation),
где arg1, arg2 – значения аргументов, operation – строка с названием операции. В зависимости от
переданного значения операции (использовать switch) выполнить одну из арифметических операций
(использовать функции из задания 5) и вернуть полученное значение.

7. Сравнить null и 0. Попробуйте объяснить результат.

8*. С помощью рекурсии организовать функцию возведения числа в степень.
Формат: function power(val, pow), где val – заданное число, pow – степень.

9**. Программа должна спросить у пользователя количество денег, которое он хочет положить в банк. Пользователь должен ввести целое число, а программа должна выдать соответствующее сообщение:
"Ваша сумма в 101 рубль успешно зачислена." - в случае если пользователь ввел 101.
"Ваша сумма в 10020 рублей успешно зачислена." - в случае если пользователь ввел 10020.
"Ваша сумма в 120104 рубля успешно зачислена." - в случае если пользователь ввел 120104.
Если пользователь введет любое другое целое число, программа также должна выдать соответствующее сообщение, в котором будет отображено это число, а также поставить верное окончание в слове "рубль". Для получения верного склонения слова (любого слова с числом) вам необходимо создать функцию.


 */