"use strict";


document.getElementById('descript').innerHTML = `<p> Задача: 
1. Объясните почему код даёт именно такие результаты?
</p>`;

f();

function f() {
    document.getElementById('decision').innerHTML = ` 
    let a = 1, b = 1, c, d;<br>

    c = ++a;<br>
    alert(c); // 2    т.к сначала а увеличивается на единицу, потом с присваивается значение а.<br>
<br>
    d = b++;<br>
    alert(d); // 1    т.к сначала d присваивается значение b, потом b увеличивается на единицу.<br>
<br>

    c = 2 + ++a;<br>
    alert(c); // 5   a увеличивается на единицу,  в прошлом примере в а легло 2, соответственно  а=3 , прибавляем 2 и присваиваем с значение 5.<br>
<br>
    d = 2 + b++;<br>
    alert(d); // 4   аналогично предыдущему примеру, но b (со значением 2) сначала складывается с 2 и присваивается d. А потом уже b увеличится на единицу.<br>
<br>
    alert(a); // 3  без комментариев, т.к. расписал в примерах.<br>
    alert(b); // 3  без комментариев, т.к. расписал в примерах.`;

}

/*

Материалы обязательные к изучению:
Видео про стрелочные функции стандарта ES6 - https://youtu.be/TjeY_VjzSt0
Видео про JSDoc - https://youtu.be/pM9YHZ5Og5E
Видео про области видимости - https://youtu.be/lP0nrofUIRU

Доп. материал по рекурсии (решения задач предоставлены на языке Java, но разобраться не сложно):
https://habrahabr.ru/post/275813/

------------------------------------------------------------------------------------------------

Домашнее задание:

1. Объясните почему код даёт именно такие результаты?
let a = 1, b = 1, c, d;

c = ++a;
alert(c); // 2

d = b++;
alert(d); // 1

c = 2+ ++a;
alert(c); // 5

d = 2+ b++;
alert(d); // 4

alert(a); // 3
alert(b); // 3

2. Чему будут равны переменные x и a в примере ниже? Написать почему так произошло (описать последовательность действий).
let a = 2;
let x = 1 + (a *= 2);

3. Объявить две переменные a и b и задать им целочисленные произвольные начальные значения.
Затем написать скрипт, который работает по следующему принципу:
- если a и b положительные, вывести их разность (ноль можно считать положительным числом);
- если а и b отрицательные, вывести их произведение;
- если а и b разных знаков, вывести их сумму;

4. Переменной а должно присваиваться случайное целое число в промежутке от 0 до 15 включительно.
С помощью оператора switch необходимо организовать вывод чисел от этой переменной a до 15.

5. Реализовать основные 4 арифметические операции (+, -, /, *) в виде функций с двумя параметрами.
Обязательно использовать оператор return.

6. Реализовать функцию с тремя параметрами: function mathOperation(arg1, arg2, operation),
где arg1, arg2 – значения аргументов, operation – строка с названием операции. В зависимости от
переданного значения операции (использовать switch) выполнить одну из арифметических операций
(использовать функции из задания 5) и вернуть полученное значение.

7. Сравнить null и 0. Попробуйте объяснить результат.

8*. С помощью рекурсии организовать функцию возведения числа в степень.
Формат: function power(val, pow), где val – заданное число, pow – степень.

9**. Программа должна спросить у пользователя количество денег, которое он хочет положить в банк. Пользователь должен ввести целое число, а программа должна выдать соответствующее сообщение:
"Ваша сумма в 101 рубль успешно зачислена." - в случае если пользователь ввел 101.
"Ваша сумма в 10020 рублей успешно зачислена." - в случае если пользователь ввел 10020.
"Ваша сумма в 120104 рубля успешно зачислена." - в случае если пользователь ввел 120104.
Если пользователь введет любое другое целое число, программа также должна выдать соответствующее сообщение, в котором будет отображено это число, а также поставить верное окончание в слове "рубль". Для получения верного склонения слова (любого слова с числом) вам необходимо создать функцию.


 */