"use strict";


document.getElementById('descript').innerHTML = `<p> Задача: 
5. Реализовать основные 4 арифметические операции (+, -, /, *) в виде функций с двумя параметрами.
Обязательно использовать оператор return.
</p>`;
console.clear();
f();

function f() {

    const a = 10, b = 5;

    function plus(a, b) {
        return a + b;
    }

    function minus(a, b) {
        return a - b;
    }

    function delit(a, b) {
        return a / b;
    }

    function mnozit(a, b) {
        return a * b;
    }

    console.log(plus(a, b));
    console.log(minus(a, b));
    console.log(delit(a, b));
    console.log(mnozit(a, b));

    document.getElementById('decision').innerHTML = ` 
   Ответ выведен в консоль.
   `;

}

/*

Материалы обязательные к изучению:
Видео про стрелочные функции стандарта ES6 - https://youtu.be/TjeY_VjzSt0
Видео про JSDoc - https://youtu.be/pM9YHZ5Og5E
Видео про области видимости - https://youtu.be/lP0nrofUIRU


5. Реализовать основные 4 арифметические операции (+, -, /, *) в виде функций с двумя параметрами.
Обязательно использовать оператор return.

6. Реализовать функцию с тремя параметрами: function mathOperation(arg1, arg2, operation),
где arg1, arg2 – значения аргументов, operation – строка с названием операции. В зависимости от
переданного значения операции (использовать switch) выполнить одну из арифметических операций
(использовать функции из задания 5) и вернуть полученное значение.

7. Сравнить null и 0. Попробуйте объяснить результат.

8*. С помощью рекурсии организовать функцию возведения числа в степень.
Формат: function power(val, pow), где val – заданное число, pow – степень.

9**. Программа должна спросить у пользователя количество денег, которое он хочет положить в банк. Пользователь должен ввести целое число, а программа должна выдать соответствующее сообщение:
"Ваша сумма в 101 рубль успешно зачислена." - в случае если пользователь ввел 101.
"Ваша сумма в 10020 рублей успешно зачислена." - в случае если пользователь ввел 10020.
"Ваша сумма в 120104 рубля успешно зачислена." - в случае если пользователь ввел 120104.
Если пользователь введет любое другое целое число, программа также должна выдать соответствующее сообщение, в котором будет отображено это число, а также поставить верное окончание в слове "рубль". Для получения верного склонения слова (любого слова с числом) вам необходимо создать функцию.


 */